{
  "clean_up_tokenization_spaces": true,
  "mask_token": "[MASK]",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "tokenizer_class": "PreTrainedTokenizerFast",
  "unk_token": "[UNK]"
}
