{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "CharDelimiterSplit",
    "delimiter": " "
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[MASK]": 2,
      "c_6": 3,
      ")": 4,
      "(": 5,
      "C_alkyl": 6,
      "1": 7,
      "2": 8,
      "=": 9,
      "C_6": 10,
      "c_5": 11,
      "c_5-6": 12,
      "3": 13,
      "N_secondary_amine": 14,
      "O_ketone": 15,
      "1\n": 16,
      "C_ketone": 17,
      "C_5": 18,
      "c_6-6": 19,
      "n_5": 20,
      "O_amide": 21,
      "C_amide": 22,
      "O_ether": 23,
      "C_tertiary_carbon": 24,
      "C_tertiary_carbon_6": 25,
      "C_5-6": 26,
      "O_sulfonyl": 27,
      "C_tertiary_carbon_5": 28,
      "O_ester": 29,
      "n_6": 30,
      "C_ester": 31,
      "-": 32,
      "n_tertiary_amine_5": 33,
      "4": 34,
      "N_tertiary_amine_6": 35,
      "C_6-6": 36,
      "F_fluoro": 37,
      "C_3": 38,
      "O_hydroxyl": 39,
      "N_amide_6": 40,
      "n_5-6": 41,
      "F_trifluoromethyl": 42,
      "C_4": 43,
      "Cl_chloro": 44,
      "C_7": 45,
      "S_sulfonyl": 46,
      "C_5-5": 47,
      "o_5": 48,
      "C_alkene": 49,
      "O_carboxyl": 50,
      "s_5": 51,
      "C_alkyl\n": 52,
      "N_amide": 53,
      "C_tertiary_carbon_3": 54,
      "N_amide_5": 55,
      "O_nitro": 56,
      "n_secondary_amine_5": 57,
      "2\n": 58,
      "N_tertiary_amine": 59,
      "C_tertiary_carbon_5-6": 60,
      "N_primary_amine": 61,
      "C_alkyne": 62,
      "O_ether_6": 63,
      "C_quaternary_carbon": 64,
      "C_tertiary_carbon_5-5": 65,
      "/": 66,
      "n_tertiary_amine_5-6": 67,
      "C_tertiary_carbon_4": 68,
      "c_5-6-6": 69,
      "S_sulfide": 70,
      "C_carboxyl": 71,
      "N_tertiary_amine_5": 72,
      "c_6-6-6": 73,
      "C_4-5": 74,
      "C_trifluoromethyl": 75,
      "c_6-5-6": 76,
      "N_amide_5-6": 77,
      "N_nitrile": 78,
      "N_nitro": 79,
      "n_6-6": 80,
      "#": 81,
      "C_6-7": 82,
      "c_6-7": 83,
      "C_tertiary_carbon_6-6": 84,
      "O_ether_5": 85,
      "O_ether_5-6": 86,
      "Br_bromo": 87,
      "n_secondary_amine_5-6": 88,
      "C_quaternary_carbon_6": 89,
      "F_difluoromethyl": 90,
      "O_ether_6-6": 91,
      "c_5-5": 92,
      "C_6-6-6": 93,
      "C_quaternary_carbon_5": 94,
      "s_5-6": 95,
      "C_amide_5": 96,
      "C_3-5": 97,
      "N_amide_6-6": 98,
      "5": 99,
      "C_tertiary_carbon_3-5": 100,
      "C_ketone_5": 101,
      "C_4-6": 102,
      "N_amide_5-5": 103,
      "C_quaternary_carbon_4": 104,
      "O_amide\n": 105,
      "F_fluoro\n": 106,
      "O_hydroxyl\n": 107,
      "N_secondary_amine_6": 108,
      "C_quaternary_carbon_3": 109,
      "O_ketone\n": 110,
      "C_quaternary_carbon_5-6": 111,
      "N_amide_7": 112,
      "C_alkene_carbon": 113,
      "N_secondary_ketimine": 114,
      "C_6-5-6": 115,
      "N_tertiary_amine_5-6": 116,
      "C_difluoromethyl": 117,
      "N_amide_4-5": 118,
      "C_5-7": 119,
      "N_amide_4": 120,
      "o_5-6": 121,
      "N_secondary_amine_5": 122,
      "c_5-5-6": 123,
      "O_O": 124,
      "Cl_chloro\n": 125,
      "\\": 126,
      "n_amide_5-6": 127,
      "C_3-6": 128,
      "C_tertiary_carbon_7": 129,
      "O_imide": 130,
      "C_ketone_6": 131,
      "C_tertiary_carbon_3-5-5": 132,
      "C_tertiary_carbon_6-6-6": 133,
      "c_amide_5-6": 134,
      "N_imide_5": 135,
      "C_ester_5": 136,
      "N_tertiary_amine_5-5": 137,
      "N_tertiary_amine_7": 138,
      "c_amide_6": 139,
      "n_amide_6": 140,
      "C_secondary_aldimine": 141,
      "N_secondary_aldimine": 142,
      "C_quaternary_carbon_4-5": 143,
      "C_quaternary_carbon_5-5": 144,
      "C_5-6-6-6": 145,
      "N_tertiary_amine_6-6": 146,
      "c_ketone_6": 147,
      "N_amide_6-7": 148,
      "C_amide_6": 149,
      "C_ketone_5-6": 150,
      "C_8": 151,
      "O_ether_6-7": 152,
      "C_tertiary_carbon_5-5-5": 153,
      "C_6-6-6-6": 154,
      "C_5-6-6": 155,
      "c_amide_6-6": 156,
      "n_amide_6-6": 157,
      "c_ketone_6-6": 158,
      "c_6-6-5-6": 159,
      "c_6-6-6-6": 160,
      "S_sulfide_5": 161,
      "C_secondary_ketimine": 162,
      "c_6-7-6": 163,
      "n_5-5": 164,
      "F_trifluoromethyl\n": 165,
      "n_secondary_amine_6": 166,
      "C_quaternary_carbon_6-6": 167,
      "c_5-6-5": 168,
      "C_5-5-5": 169,
      "n_5-6-6": 170,
      ".": 171,
      "O_carboxyl\n": 172,
      "S_thioketone": 173,
      "C_ketone_6-6": 174,
      "C_4-4": 175,
      "C_tertiary_carbon_5-6-6-6": 176,
      "N_secondary_amine_6-6": 177,
      "C_tertiary_carbon_4-5": 178,
      "N_secondary_amine_5-6": 179,
      "C_amide_5-6": 180,
      "N_tertiary_amine_4": 181,
      "S_sulfide_6": 182,
      "C_secondary_ketimine_5": 183,
      "O_nitro\n": 184,
      "S_sulfonyl_5": 185,
      "O_carbamate": 186,
      "c_ketone_5-6": 187,
      "C_5-6-5": 188,
      "n_amide_5": 189,
      "C_3-5-5": 190,
      "c_6-5-6-6": 191,
      "n_6-5-6": 192,
      "N_primary_ketimine": 193,
      "N_secondary_ketimine_5": 194,
      "c_5-7": 195,
      "n_tertiary_amine_5-5": 196,
      "C_3-4": 197,
      "O_ester_5": 198,
      "n_secondary_amine_6-6": 199,
      "c_5-6-6-6-6": 200,
      "O_sulfinyl": 201,
      "S_sulfinyl": 202,
      "C_5-5-6": 203,
      "C_imide_5": 204,
      "C_tertiary_carbon_4-6": 205,
      "C_thioketone": 206,
      "c_5-6-6-6": 207,
      "C_amide_6-6": 208,
      "N_imide_5-6": 209,
      "Br_bromo\n": 210,
      "o_6-6": 211,
      "C_tertiary_carbon_6-6-6-6": 212,
      "O_sulfonyl\n": 213,
      "c_amide_5": 214,
      "n_imide_5-6": 215,
      "C_quaternary_carbon_4-6": 216,
      "N_amide_4-6": 217,
      "O_ether_5-5": 218,
      "O_sulfonate_ester": 219,
      "n_imide_6": 220,
      "C_tertiary_carbon_3-6": 221,
      "s_5-5": 222,
      "N_primary_amine\n": 223,
      "S_sulfhydryl": 224,
      "3\n": 225,
      "6": 226,
      "C_aldehyde": 227,
      "C_quaternary_carbon_6-7": 228,
      "c_5-6-7": 229,
      "C_6-6-6-6-6": 230,
      "C_primary_ketimine": 231,
      "C_quaternary_carbon_3-5": 232,
      "N_nitrile\n": 233,
      "F_difluoromethyl\n": 234,
      "c_3-5-6": 235,
      "I_iodo": 236,
      "c_5-7-6": 237,
      "n_tertiary_amine_5-6-6": 238,
      "C_carbamate": 239,
      "C_ketone_5-5": 240,
      "C_quaternary_carbon_6-6-6": 241,
      "N_amide_6-6-6": 242,
      "N_carbamate": 243,
      "O_O[-1]": 244,
      "O_aldehyde": 245,
      "c_ester_6": 246,
      "n_imide_6-6": 247,
      "C_ester_5-6": 248,
      "C_tertiary_carbon_5-6-6": 249,
      "C_tertiary_carbon_5-7": 250,
      "N_secondary_amine_5-5": 251,
      "N_secondary_amine_7": 252,
      "c_5-6-6-5": 253,
      "c_secondary_ketimine_6": 254,
      "S_sulfonyl_6": 255,
      "c_5-7-6-6": 256,
      "n_5-7": 257,
      "S_S": 258,
      "C_secondary_ketimine_5-6": 259,
      "C_tertiary_carbon_4-4": 260,
      "O_ether_7": 261,
      "c_6-16-6-6-6": 262,
      "c_6-20-6-6-6-6-20-6": 263,
      "c_6-6-18-6-6-18-6-6": 264,
      "c_6-7-7": 265,
      "C_6-6-5-6": 266,
      "C_6-7-7": 267,
      "C_quaternary_carbon_3-6": 268,
      "C_tertiary_carbon_4-5-5": 269,
      "N_tertiary_amine_6-6-6": 270,
      "N_tertiary_amine_6-7": 271,
      "C_3-3": 272,
      "C_5-4-5": 273,
      "C_tertiary_carbon_33": 274,
      "O_ether_6-6-6": 275,
      "c_5-6-5-6": 276,
      "C_quaternary_carbon_3-4": 277,
      "N_tertiary_amine_3-5": 278,
      "O_ether_5-6-6": 279,
      "n_5-5-6": 280,
      "C_5-5-5-31": 281,
      "C_ketone_5-5-5": 282,
      "C_ketone_7": 283,
      "C_quaternary_carbon_5-6-6-6": 284,
      "C_tertiary_carbon_6-7": 285,
      "N_secondary_ketimine_5-6": 286,
      "O_5": 287,
      "O_ether_4-5": 288,
      "S_sulfonyl_5-6": 289,
      "n_amide_5-6-6": 290,
      "n_tertiary_amine_6-5-6": 291,
      "C_tertiary_carbon_3-4": 292,
      "C_tertiary_carbon_6-6-6-6-6": 293,
      "O_ether_3-5-5": 294,
      "O_ether_4-6": 295,
      "O_sulfonic_acid": 296,
      "c_3-6-5": 297,
      "c_5-5-7": 298,
      "c_5-6-5-5-6-6-8": 299,
      "c_6-5-6-6-6": 300,
      "c_6-7-6-5-5-6-5-6": 301,
      "n_tertiary_amine_6": 302,
      "C_ester_6": 303,
      "C_imide_5-6": 304,
      "C_quaternary_carbon_4-4": 305,
      "C_quaternary_carbon_6-5-6": 306,
      "C_secondary_ketimine_6": 307,
      "N_tertiary_amine_4-5": 308,
      "S_sulfide_6-6": 309,
      "c_5-7-5": 310,
      "c_amide_5-6-6": 311,
      "n_5-6-5": 312,
      "n_6-6-6": 313,
      "n_tertiary_amine_6-6": 314,
      "C_4-4-4": 315,
      "C_4-5-5": 316,
      "C_5-7-6": 317,
      "C_amide_7": 318,
      "C_ester\n": 319,
      "C_quaternary_carbon_6-6-6-6-6": 320,
      "C_tertiary_carbon_6-5-6": 321,
      "N_amide_3-5": 322,
      "N_azo": 323,
      "S_sulfide_5-6": 324,
      "c_5-16-5-5-5": 325,
      "c_6-9-5-6": 326,
      "n_secondary_amine_5-5": 327,
      "n_tertiary_amine_5-7": 328,
      "N_amide_5-7": 329,
      "N_secondary_amine_6-7": 330,
      "O_ether_3-5": 331,
      "O_ether_4": 332,
      "c_5-22-5-6-6-22": 333,
      "c_5-6-5-6-6-6": 334,
      "C_amide_33": 335,
      "C_amide_6-7": 336,
      "C_ester_6-6": 337,
      "C_quaternary_carbon_5-5-6": 338,
      "C_tertiary_carbon_6-6-5-6": 339,
      "N_amide_33": 340,
      "N_imide_6": 341,
      "N_secondary_ketimine_6": 342,
      "O_acetal": 343,
      "O_ether_5-5-5": 344,
      "c_4-6-6": 345,
      "c_5-6-5-6-6": 346,
      "c_secondary_ketimine_5": 347,
      "s_6-5-6": 348,
      "C_5-6-6-6-6": 349,
      "C_5-7-5": 350,
      "C_5-8": 351,
      "C_7-7": 352,
      "C_quaternary_carbon_5-6-5": 353,
      "C_quaternary_carbon_6-6-6-6": 354,
      "C_quaternary_carbon_7": 355,
      "C_tertiary_carbon_5-5-6": 356,
      "N_ketoxime": 357,
      "S_sulfonyl_6-6": 358,
      "c_6-5-6-5-6": 359,
      "c_amide_6-5-6": 360,
      "n_amide_6-5-6": 361,
      "n_secondary_amine_6-5-6": 362,
      "o_6": 363,
      "C_15": 364,
      "C_6-14-14": 365,
      "C_6-9-5-6": 366,
      "C_ketone_5-5-6": 367,
      "C_ketone_6-7": 368,
      "C_ketoxime": 369,
      "C_tertiary_carbon_5-5-6-5": 370,
      "N_tertiary_amine_5-7": 371,
      "O_ester\n": 372,
      "O_ester_5-6": 373,
      "c_5-17-6-17-6": 374,
      "c_5-5-5-6": 375,
      "c_5-6-6-6-6-5": 376,
      "c_5-6-6-6-6-6": 377,
      "c_5-6-8-6": 378,
      "c_6-16-6-6": 379,
      "c_6-18-6-6": 380,
      "c_6-19-6-19-6": 381,
      "c_6-5-5-6-6": 382,
      "c_6-6-5-5-6": 383,
      "c_6-8": 384,
      "c_6-8-6": 385,
      "C_12": 386,
      "C_5-5-6-6-6": 387,
      "C_5-6-6-5": 388,
      "C_6-5-6-6": 389,
      "C_ketone_5-6-6": 390,
      "C_tertiary_carbon_8": 391,
      "N_imide_5-5": 392,
      "N_tertiary_amine_6-5-6": 393,
      "c_6-5-5-6": 394,
      "c_amide_6-6-6": 395,
      "n_amide_6-6-6": 396,
      "n_tertiary_amine_5-5-6": 397,
      "C_5-5-16-6": 398,
      "C_5-6-16-6-16": 399,
      "C_6-5-5-6-6": 400,
      "C_6-5-7": 401,
      "C_ketone_6-6-6": 402,
      "C_tertiary_carbon_5-4-5": 403,
      "C_tertiary_carbon_5-5-5-6": 404,
      "C_tertiary_carbon_6-7-7": 405,
      "N_amide_5-5-6": 406,
      "N_amide_5-6-6": 407,
      "N_amide_6-5-6": 408,
      "N_imide_5-5-5": 409,
      "N_secondary_amine_5-5-6": 410,
      "S_sulfonate_ester": 411,
      "c_6-5-7": 412,
      "c_imide_5-6": 413,
      "c_imide_6": 414,
      "c_imide_6-6": 415,
      "n_6-5-6-6": 416,
      "*": 417,
      "C_3-14-5": 418,
      "C_5-25-6-25": 419,
      "C_5-5-7": 420,
      "C_5-6-5-6": 421,
      "C_5-6-6-6-6-6": 422,
      "C_5-6-7": 423,
      "C_6-11": 424,
      "C_6-20-20": 425,
      "C_6-5-6-7": 426,
      "C_6-7-6": 427,
      "C_tertiary_carbon_3-5-6": 428,
      "C_tertiary_carbon_3-6-5": 429,
      "C_tertiary_carbon_4-4-4": 430,
      "N_secondary_amine_6-6-6": 431,
      "N_tertiary_amine_4-6": 432,
      "O_carboxylate": 433,
      "O_ketoxime": 434,
      "S_sulfide_5-5": 435,
      "c_5-5-5": 436,
      "c_ketone_6-6-6": 437,
      "n_secondary_amine_5-6-6": 438,
      "4\n": 439,
      "7": 440,
      "C_5-5-5-6": 441,
      "C_5-5-6-5": 442,
      "C_amide_5-5": 443,
      "C_imide_5-5": 444,
      "C_ketone_33": 445,
      "C_quaternary_carbon_4-4-4": 446,
      "C_quaternary_carbon_5-6-6": 447,
      "C_secondary_ketimine_6-6": 448,
      "C_secondary_ketimine_6-7": 449,
      "C_tertiary_carbon_5-25-6-25": 450,
      "C_tertiary_carbon_5-6-6-6-6-6": 451,
      "C_tertiary_carbon_6-6-5-6-5-6": 452,
      "N_secondary_amine_33": 453,
      "N_secondary_ketimine_6-7": 454,
      "O_O\n": 455,
      "O_carbonate_ester": 456,
      "c_5-19-6": 457,
      "c_6-5-5-7": 458,
      "c_6-6-6-5-7": 459,
      "n_5-6-6-6-6": 460,
      "o_6-6-6": 461,
      "s_5-6-6": 462,
      "C_3-5-11": 463,
      "C_3-5-6": 464,
      "C_4-7": 465,
      "C_5-19-6": 466,
      "C_5-6-6-6-5": 467,
      "C_6-18-6-6": 468,
      "C_6-19-6-19-6": 469,
      "C_6-20-6-6-6-6-20-6": 470,
      "C_acetal": 471,
      "C_ketone_4": 472,
      "C_ketone_6-5-6": 473,
      "C_quaternary_carbon_3-3": 474,
      "C_tertiary_carbon_3-3": 475,
      "C_tertiary_carbon_3-4-4": 476,
      "C_tertiary_carbon_5-6-6-6-6": 477,
      "N_N": 478,
      "N_N[1]": 479,
      "N_amide_3-6": 480,
      "N_amide_5-5-5": 481,
      "N_secondary_amine_5-6-6": 482,
      "N_secondary_ketimine_6-6": 483,
      "N_tertiary_amine_3-6": 484,
      "N_tertiary_amine_5-6-6": 485,
      "O_ester_6-6": 486,
      "O_ether_5-6-5": 487,
      "O_ether_6-5-6": 488,
      "O_phosphate": 489,
      "O_sulfinyl\n": 490,
      "P_P": 491,
      "c_secondary_ketimine_5-6": 492,
      "c_thioketone_5": 493,
      "n_tertiary_amine_5-6-5": 494,
      "Br_Br[-1]": 495,
      "C_18": 496,
      "C_4-6-6": 497,
      "C_5-11-6": 498,
      "C_5-13-6": 499,
      "C_6-21-21": 500,
      "C_6-6-18-6-6-18-6-6": 501,
      "C_6-6-5-6-5-6": 502,
      "C_6-6-7-7": 503,
      "C_6-8": 504,
      "C_quaternary_carbon_5-5-5": 505,
      "C_quaternary_carbon_6-5-5-6-6": 506,
      "C_secondary_ketimine_5-5": 507,
      "C_tertiary_carbon_22": 508,
      "C_tertiary_carbon_3-6-6-5-6": 509,
      "C_tertiary_carbon_5-5-5-31": 510,
      "C_tertiary_carbon_5-6-6-5": 511,
      "C_tertiary_carbon_5-7-6": 512,
      "C_tertiary_carbon_7-7": 513,
      "C_trimethylsilyl": 514,
      "Cl_Cl[-1]\n": 515,
      "Cl_trichloromethyl": 516,
      "N_amide_5-6-5": 517,
      "N_amide_6-7-7": 518,
      "N_azide": 519,
      "N_secondary_amine_4": 520,
      "N_secondary_amine_6-5-6": 521,
      "N_tertiary_amine_5-5-5": 522,
      "N_tertiary_amine_5-6-6-6": 523,
      "N_tertiary_amine_6-6-6-6": 524,
      "O_ether_3-6": 525,
      "S_sulfide_7": 526,
      "S_sulfinyl_6": 527,
      "S_sulfonic_acid": 528,
      "c_3-20-6-20": 529,
      "c_4-6": 530,
      "c_5-11-6": 531,
      "c_5-13-6": 532,
      "c_5-20-5": 533,
      "c_5-5-16-6": 534,
      "c_5-6-16-6-16": 535,
      "c_5-6-6-6-5": 536,
      "c_6-17": 537,
      "c_6-20-20": 538,
      "c_6-6-7-6": 539,
      "n_5-7-6-6": 540,
      "n_imide_5-5-6": 541,
      "n_tertiary_amine_5-5-7": 542,
      "n_tertiary_amine_5-7-5": 543,
      "n_tertiary_amine_6-6-6": 544,
      "o_5-6-6": 545,
      "o_6-5-6": 546,
      "C_17": 547,
      "C_24": 548,
      "C_3-20-6-20": 549,
      "C_3-4-6": 550,
      "C_4-4-5": 551,
      "C_5-14": 552,
      "C_5-20-5": 553,
      "C_5-22-5-6-6-22": 554,
      "C_6-16-6-6": 555,
      "C_6-17": 556,
      "C_6-5-5-7": 557,
      "C_6-6-7-6": 558,
      "C_amide_5-6-6": 559,
      "C_amide_6-6-6": 560,
      "C_carboxylate": 561,
      "C_ester_4": 562,
      "C_ester_5-6-6": 563,
      "C_imide": 564,
      "C_imide_6": 565,
      "C_ketone_22": 566,
      "C_ketone_24": 567,
      "C_ketone_5-6-6-6": 568,
      "C_quaternary_carbon_5-5-5-6": 569,
      "C_quaternary_carbon_5-6-6-6-6": 570,
      "C_quaternary_carbon_6-6-5-6": 571,
      "C_quaternary_carbon_6-6-6-5-7": 572,
      "C_tertiary_carbon_15": 573,
      "C_tertiary_carbon_20": 574,
      "C_tertiary_carbon_3-5-11": 575,
      "C_tertiary_carbon_5-6-6-6-5": 576,
      "C_tertiary_carbon_5-7-5": 577,
      "N_4_ammonium_ion": 578,
      "N_amide_5-5-5-31": 579,
      "N_secondary_amine_22": 580,
      "N_secondary_amine_24": 581,
      "N_secondary_amine_3-5": 582,
      "N_secondary_amine_4-5": 583,
      "N_secondary_amine_6-7-6": 584,
      "N_tertiary_amine_3": 585,
      "O_borono": 586,
      "S_sulfide_5-7": 587,
      "S_sulfonyl_6-6-6": 588,
      "S_thioketone\n": 589,
      "c_6-5-6-7": 590,
      "c_ester_6-6": 591,
      "c_ketone_6-5-6": 592,
      "c_secondary_ketimine_6-6": 593,
      "c_thioketone_6-6": 594,
      "n_5-7-5": 595,
      "n_amide_5-5-6": 596,
      "n_amide_5-6-5": 597,
      "o_5-5": 598,
      "s_5-5-6": 599
    },
    "unk_token": "[UNK]"
  }
}